bot_menu = {
    'start': 'Начало',
    'help': 'помощь',
    'menu': 'меню магазина'
}

registration = {
    'error_registration': 'У вас уже есть аккаунт!',
    'name': 'Приветсвуем вас в нашем магазине! Для начала работы '
             'нужно пройти регистрацию, введите свое имя',
    'surname': 'Введите свою фамилию',
    'email': 'Введите свою почту',
    'error_data': 'Вы ввели некорректные данные, попробуйте снова!',
    'end': 'Вы успешно прошли регистрацию!'
}

menu_buttons = {
    'profile': 'Профиль',
    'market': 'Магазин',
    'cart': 'Корзина'
}

menu_text = {
    'main': 'Вы находитесь в главном меню магазина!'
}

profile_main_buttons = {
    'edit_profile': 'Редактировать профиль',
    'active_orders': 'Активные заказы',
    'orders_history': 'История заказов',
    'back_to_menu': 'Вернуться в меню'
}

profile_edit_buttons = {
    'name': 'Имя',
    'surname': 'Фамилия',
    'email': 'Почта',
    'back': 'Назад'
}

profile_edit_texts = {
    'edit_param': 'Выберите изменяемое значение',
    'edit_value': 'Введите данные',
    'edit_value_error': 'Вы ввели неккоректные данные! Попробуйте снова',
    'accept': 'Сохранить изменения?',
    'end': 'Вы успешно обновили профиль!'
}

profile_texts = {
    'main': 'Ваш профиль:\n{} {}\nemail: {}\n'
            'Количество заказов: {}\n''Потрачено денег: {}\n'
}

profile_end = {
    'back_to_profile': 'Вернуться в профиль',
    'back_to_menu': 'Вернуться в меню'
}

market_menu = {
    'categories': 'Выбрать категорию',
    'bacK_to_menu': 'Вернуться в меню'
}

market_texts = {
    'choose_category': 'Вы находитесь в каталоге товаров нашего магазина!\n'
            'Ниже представлены все доступные к покупке категории книг,',
    'choose_goods': 'Список всех доступных книг в категории {}',
    'check_goods': '<u><b>Название</b></u>: {}\n<u><b>Автор</b></u>: {}\n<u><b>Категория</b></u>: {}\n'
                  '<u><b>Описание</b></u>: {}\n<u><b>Цена</b></u>: {}\n<u><b>Штук в наличии</b></u>: {}',
    'buy_value': 'Выберите количество книг, которое хотите приобрести',
    'put_cart_succesfull': 'Вы успешно добавили в корзину книгу {} в количестве {}'
}

market_buy_or_put_buttons = {
    'buy': 'Купить',
    'put': 'Добавить в корзину',
}

profile_accept_buttons = {
    'yes': 'Да',
    'back': 'Назад',
    'back_to_profile': 'Вернуться в профиль',
    'back_to_menu': 'Вернуться в меню'
}


cart = {
    'check_cart': 'У вас в корзине {} на общую сумму {}',
    'check_item': '<u><b>Название</b></u>: {}\n<u><b>Автор</b></u>: {}\n<u><b>Категория</b></u>: {}\n'
                  '<u><b>Описание</b></u>: {}\n<u><b>Цена</b></u>: {}\n<u><b>Штук в наличии</b></u>: {}',
    'delete_item': 'Вы точно хотите удалить товар из корзины?',
    'choose_items': 'Выберите нужные вам товары'
}

check_cart_buttons = {
    'choose': 'Выбрать',
    'buy_all': 'Купить всё'
}

cart_check_item_buttons = {
    'buy': 'Купить',
    'delete':'Удалить из корзины'
}

put_choose_plural = {
    'orders_value': ['заказ', 'заказа', 'заказов'],
    'orders_sum': ['рубль', 'рубля', 'рублей'],
    'cart_good_value': ['штука', 'штуки', 'штук']
}

back_buttons = {
    'back': 'Назад',
    'back_to_menu': 'Вернуться в меню'
}

accept_buttons = {
    'yes': 'Да',
    'back': 'Назад',
    'back_to_menu': 'Вернуться в меню'
}
